FemDesign.Materials.Concrete
material_type --> concrete

FemDesign.Materials.Concrete.SetMaterialParameters(System.Double,System.Double,System.Double,System.Double,System.Double)
Set Material parameters.